INSERT INTO TB_CLASSIFICATION (
    IS_ACTIVATED, CLASSIFICATION_ID, CLASSIFICATION_PARENT_ID, CREATED_DATE_TIME,
    INACTIVATED_DATE_TIME, MODIFIED_DATE_TIME, CLASSIFICATION_NAME, CREATED_BY,
    MODIFIED_BY, CLASSIFICATION_CODE
) VALUES
    -- RANK (직급)
    (TRUE, 1, 2, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '사원', 'admin', 'admin', 'R'),
    (TRUE, 2, 3, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '선임', 'admin', 'admin', 'R'),
    (TRUE, 3, 4, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '책임', 'admin', 'admin', 'R'),
    (TRUE, 4, 5, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '수석', 'admin', 'admin', 'R'),
    (TRUE, 5, 6, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '팀장', 'admin', 'admin', 'R'),
    (TRUE, 6, 7, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '이사', 'admin', 'admin', 'R'),
    (TRUE, 7, 8, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '부사장', 'admin', 'admin', 'R'),
    (TRUE, 8, 0, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '사장', 'admin', 'admin', 'R'),

    -- GRADE (등급)
    (TRUE, 9, 0, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '초급', 'admin', 'admin', 'G'),
    (TRUE, 10, 0, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '중급', 'admin', 'admin', 'G'),
    (TRUE, 11, 0, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '고급', 'admin', 'admin', 'G'),
    (TRUE, 12, 0, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '특급', 'admin', 'admin', 'G'),

    -- TYPE (고용 형태)
    (TRUE, 13, 0, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '정직원', 'admin', 'admin', 'T'),
    (TRUE, 14, 0, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '프리랜서', 'admin', 'admin', 'T'),
    (TRUE, 15, 0, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '외주', 'admin', 'admin', 'T'),
    (TRUE, 16, 0, '2025-02-20 16:19:37.665402', NULL, '2025-02-20 16:19:37.665402', '반프리', 'admin', 'admin', 'T');